src/cf/AccumulationRegisters/Бонусы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>Бонусы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Documents/СписаниеБонусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>СписаниеБонусов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Бонусы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выгружен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonModules/ОбменСКроликом/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗагрузкаДисконтныхКарт() Экспорт
	Данные = ДанныеДляПодключенияКролика();	
	Данные.Вставить("ИмяОчереди", "discount_cards_from_mobile");
	
	ПодключитьВнешнююКомпоненту("ОбщийМакет.PinkRabbitMQ", "BITERP", ТипВнешнейКомпоненты.Native);
	Клиент  = Новый("AddIn.BITERP.PinkRabbitMQ");
	Попытка
		Клиент.Connect(
		Данные.ИмяХоста,
		Данные.Порт,
		Данные.Логин,
		Данные.Пароль,
		Данные.ВиртуальныйХост);
		
		
		ИмяОчереди = Данные.ИмяОчереди;
		
		Попытка
			Потребитель = Клиент.BasicConsume(ИмяОчереди, "", Истина, Ложь, 0);
			ОтветноеСообщение = "";
			Если Клиент.BasicConsumeMessage("", ОтветноеСообщение, 5) Тогда
				Клиент.BasicAck(); 
				ОбработкаДанныхДисконтныхКарт(ОтветноеСообщение);
			Иначе
			КонецЕсли;
			Клиент.BasicCancel("");
		Исключение
			ВызватьИсключение Клиент.GetLastError();
		КонецПопытки;
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка чтения сообщения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗагрузкаЗаявокНаВывод() Экспорт
	Данные = ДанныеДляПодключенияКролика();	
	Данные.Вставить("ИмяОчереди", "withdrawal_request");
	
	ПодключитьВнешнююКомпоненту("ОбщийМакет.PinkRabbitMQ", "BITERP", ТипВнешнейКомпоненты.Native);
	Клиент  = Новый("AddIn.BITERP.PinkRabbitMQ");
	Попытка
		Клиент.Connect(
		Данные.ИмяХоста,
		Данные.Порт,
		Данные.Логин,
		Данные.Пароль,
		Данные.ВиртуальныйХост);
		
		
		ИмяОчереди = Данные.ИмяОчереди;
		
		Попытка
			Потребитель = Клиент.BasicConsume(ИмяОчереди, "", Истина, Ложь, 0);
			ОтветноеСообщение = "";
			Если Клиент.BasicConsumeMessage("", ОтветноеСообщение, 5) Тогда
				Клиент.BasicAck(); 
				ОбработкаЗаявокНаВывод(ОтветноеСообщение);
			Иначе
			КонецЕсли;
			Клиент.BasicCancel("");
		Исключение
			ВызватьИсключение Клиент.GetLastError();
		КонецПопытки;
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка чтения сообщения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
КонецПроцедуры

Процедура ВыгрузкаОстатковБонусов() Экспорт
	Данные = ДанныеДляПодключенияКролика();	
	Данные.Вставить("ИмяОчереди", "balances");
	Данные.Вставить("Ключ", "bl");
	
	ПодключитьВнешнююКомпоненту("ОбщийМакет.PinkRabbitMQ", "BITERP", ТипВнешнейКомпоненты.Native);
	Клиент  = Новый("AddIn.BITERP.PinkRabbitMQ");
	
	Клиент.Connect(
	Данные.ИмяХоста,
	Данные.Порт,
	Данные.Логин,
	Данные.Пароль,
	Данные.ВиртуальныйХост);
	
	ИмяОчереди = Данные.ИмяОчереди;
	ТочкаОбмена = Данные.ИмяТочкиОбмена;
	
	АктуальныеОстатки = ОстаткиБонусов();
	
	Для Каждого Остаток Из АктуальностьДанных Цикл
	ДанныеJSON = Новый Структура;
	ДанныеJSON.Вставить("cardNumber", Остаток.КодКарты);
	ДанныеJSON.Вставить("amount", Остаток.КолБонусов);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеJSON);
	ТекстСообщения = ЗаписьJSON.Закрыть();	
	
	Попытка	
	
		Клиент.BasicPublish(
			ТочкаОбмена,     // exchange
			Данные.Ключ,     // routingKey - тот ключ, по которому настроена привязка
			ТекстСообщения,  // message
			0,               // livingTime
			Ложь             // persist
		);
		
		ЗаписьЖурналаРегистрации("Выгрузка остатков бонусов", , , , 
			"Сообщение успешно отправлено в exchange: " + ТочкаОбмена + " с ключом: bl");
		
	Исключение
		ТекстОшибки = "Выгрузка остатков бонусов завершилась с ошибкой: " + ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Выгрузка остатков бонусов", , , , ТекстОшибки, УровеньЖурналаРегистрации.Ошибка);
	КонецПопытки;	  
	КонецЦикла;
КонецПроцедуры

Процедура ВыгрузкаЗаявокНаВывод() Экспорт
	Данные = ДанныеДляПодключенияКролика();	
	Данные.Вставить("ИмяОчереди", "accepted_output");
	Данные.Вставить("Ключ", "ou");
	
	ПодключитьВнешнююКомпоненту("ОбщийМакет.PinkRabbitMQ", "BITERP", ТипВнешнейКомпоненты.Native);
	Клиент  = Новый("AddIn.BITERP.PinkRabbitMQ");
	
	Клиент.Connect(
	Данные.ИмяХоста,
	Данные.Порт,
	Данные.Логин,
	Данные.Пароль,
	Данные.ВиртуальныйХост);
	
	ИмяОчереди = Данные.ИмяОчереди;
	ТочкаОбмена = Данные.ИмяТочкиОбмена;

    Узел = ПланыОбмена.Мобильные.НайтиПоКоду("002");
	Заявки = ЗаявкиНаВывод(Узел);   
		
	Для Каждого Заявка Из Заявки Цикл 
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(); 
	ДанныеJSON = Новый Структура;
	ДанныеJSON.Вставить("cardNumber", Заявка.КодКарты);
	ДанныеJSON.Вставить("amount", Заявка.КолБонусов);	
	ЗаписатьJSON(ЗаписьJSON, ДанныеJSON);
	ТекстСообщения = ЗаписьJSON.Закрыть();	
	
	Попытка	
		Клиент.BasicPublish(
			ТочкаОбмена,     // exchange
			Данные.Ключ,     // routingKey - тот ключ, по которому настроена привязка
			ТекстСообщения,  // message
			0,               // livingTime
			Ложь             // persist
		);
		
	ЗаписьЖурналаРегистрации("Выгрузка остатков бонусов", , , , 
			"Сообщение успешно отправлено в exchange: " + ТочкаОбмена + " с ключом: bl"); 
	Ссылка = Документы.СписаниеБонусов.ПолучитьСсылку(Заявка.ИД);
	ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Ссылка);	
	Исключение
		ТекстОшибки = "Выгрузка остатков бонусов завершилась с ошибкой: " + ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Выгрузка остатков бонусов", , , , ТекстОшибки, УровеньЖурналаРегистрации.Ошибка);
	КонецПопытки;
	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляПодключенияКролика()
	Данные = Новый Структура;
	Данные.Вставить("ИмяХоста", "localhost");
	Данные.Вставить("Порт", 5672);
	Данные.Вставить("Логин", "guest");
	Данные.Вставить("Пароль", "guest");
	Данные.Вставить("ВиртуальныйХост", "otus");
	Данные.Вставить("ИмяТочкиОбмена", "discount_cards");
	
	Возврат Данные;
КонецФункции             

Процедура ОбработкаДанныхДисконтныхКарт(ОтветноеСообщение)
	РеквизитыКонтрагента = СтрокуJSONВСтруктуру(ОтветноеСообщение);      
	Контрагент = КонтрагентПоРеквизитам(РеквизитыКонтрагента);
	СоздатьДисконтнуюКарту(Контрагент);
КонецПроцедуры  

Процедура ОбработкаЗаявокНаВывод(ОтветноеСообщение)
	РеквизитыЗаявки = СтрокуJSONВСтруктуру(ОтветноеСообщение);  
	СоздатьЗаявкуНаВывод(РеквизитыЗаявки);  
КонецПроцедуры                                                  

Функция СтрокуJSONВСтруктуру(Значение)
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Значение);
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;
КонецФункции  

Функция КонтрагентПоРеквизитам(Реквизиты)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Контрагенты.Телефон КАК Телефон,
	|	Контрагенты.Наименование КАК Наименование,
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Телефон = &Телефон
	|	И Контрагенты.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Телефон", Реквизиты.phoneNumber);
	Запрос.УстановитьПараметр("Наименование", СтрШаблон("%1 %2 %3", Реквизиты.surname, Реквизиты.name, Реквизиты.middleName));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		
		Возврат НовыйКонтрагент(Реквизиты);
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции

Функция НовыйКонтрагент(Реквизиты)
	НовКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
	НовКонтрагент.Наименование = СтрШаблон("%1 %2 %3", Реквизиты.surname, Реквизиты.name, Реквизиты.middleName);
	НовКонтрагент.Телефон = Реквизиты.phoneNumber;
	НовКонтрагент.ОбменДанными.Загрузка = Истина;
	НовКонтрагент.Записать();
	
	Возврат НовКонтрагент.Ссылка;
КонецФункции    

Процедура СоздатьДисконтнуюКарту(Контрагент)  
	ДК = Справочники.ДисконтныеКарты.СоздатьЭлемент(); 
	ДК.УстановитьНовыйКод();
	ДК.ОбменДанными.Загрузка = Истина;
	ДК.Владелец = Контрагент;
	ДК.Записать();
КонецПроцедуры    

Процедура СоздатьЗаявкуНаВывод(РеквизитыЗаявки)
	ДискотнаяКарта = Справочники.ДисконтныеКарты.НайтиПоКоду(РеквизитыЗаявки.cardNumber);
	Если ДискотнаяКарта.Пустая() Тогда 
		ТекстСообщения = СтрШаблон( "Не найдена карта с номером %1", РеквизитыЗаявки.cardNumber);
		ЗаписьЖурналаРегистрации("Загрузка заявок",, ,,ТекстСообщения); 
		Возврат;
	КонецЕсли;
	
	ДокСписание = Документы.СписаниеБонусов.СоздатьДокумент();     
	ДокСписание.Дата = ТекущаяДатаСеанса();
	ДокСписание.ДисконтнаяКарта = ДискотнаяКарта;
	ДокСписание.Бонусов = РеквизитыЗаявки.amount;
	ДокСписание.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры 

Функция ЗаявкиНаВывод(Узел)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СписаниеБонусовИзменения.Ссылка КАК Ссылка,
	               |	СписаниеБонусовИзменения.Ссылка.ДисконтнаяКарта.Код КАК КодКарты,
	               |	СписаниеБонусовИзменения.Ссылка.Бонусов КАК КолБонусов
	               |ИЗ
	               |	Документ.СписаниеБонусов.Изменения КАК СписаниеБонусовИзменения
	               |ГДЕ
	               |	СписаниеБонусовИзменения.Ссылка.Проведен
	               |	И НЕ СписаниеБонусовИзменения.Ссылка.Выгружен
	               |	И СписаниеБонусовИзменения.Узел = &Узел";      
	
	Запрос.УстановитьПараметр("Узел", Узел);
	Результат = Запрос.Выполнить();
	Заявки = Новый Массив();
	Если Не Результат.Пустой() Тогда 
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл 
			Структура = Новый Структура;
			Структура.Вставить("КодКарты", Выборка.КодКарты);
			Структура.Вставить("КолБонусов", Выборка.КолБонусов);
			Структура.Вставить("ИД", Выборка.Ссылка.УникальныйИдентификатор());
			Заявки.Добавить(Структура);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Заявки;
КонецФункции

Функция ОстаткиБонусов()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	БонусыОстатки.ДисконтнаяКарта.Код КАК КодКарты,
	               |	БонусыОстатки.СуммаОстаток КАК КолБонусов
	               |ИЗ
	               |	РегистрНакопления.Бонусы.Остатки(, ) КАК БонусыОстатки
	               |ГДЕ
	               |	НЕ БонусыОстатки.ДисконтнаяКарта.Неактивна";      
	
	
	Результат = Запрос.Выполнить();
	Остатки = Новый Массив();
	Если Не Результат.Пустой() Тогда 
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл 
			Структура = Новый Структура;
			Структура.Вставить("КодКарты", Выборка.КодКарты);
			Структура.Вставить("КолБонусов", Выборка.КолБонусов);
			Остатки.Добавить(Структура);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Остатки;
	
КонецФункции


#КонецОбласти
